# boj2193.py
'''
n = 1 >> 1
n = 2 >> 10
n = 3 >> 100, 101
n = 4 >> 1000, 1001, 1010
n = 5 >> 10000, 10001, 10010, 10100, 10101
n = 6 >> 100000, 100001, 100010, 100100, 101000, \
        100101, 101001, 101010
n = 7 >> 1000000, 1000001, 1000010, 1000100, 1001000, 1010000, \
        1000101, 1001001, 1001010, 1010001, 1010010, 1010100, 1010101,
점화식
dp[n] = dp[n-2] + dp[n-1]

n = int(input())
dp = [0, 1, 1]
for i in range(3, 100):
    dp.append(dp[i-1] + dp[i-2])
print(dp[n])
'''


# boj1796.py
'''
1. 왼쪽 오른쪽으로 나눠서 dp를 하면 될거 같음(처음은 무조건 오른쪽만 가겠지만)
2. 1을 어떻게 구현할까 1시간 가량 생각했으니 딱히 방법을 모르겠음..
3. 그래서 다른 사람의 소스를 참조함

'''